Aufgaben/Aufgabe1.tex
% Created 2023-05-11 Thu 19:37
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{org-template.tex}
\author{Lukas Wais}
\date{\today}
\title{Aufgabe 1: Wiederholung und Kompetenzcheck}
\hypersetup{
 pdfauthor={Lukas Wais},
 pdftitle={Aufgabe 1: Wiederholung und Kompetenzcheck},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={Germanb}}
\begin{document}

\maketitle

\section*{Schreibe folgende SQL Abfragen}
\label{sec:org11061c4}

\begin{enumerate}
\item Liste alle Länder auf
\item Gib die Kontinente und deren Ländern aus
\item Ermittle die Gesamtanzahl der Länder in jedem Kontinent
\item Selektiere alle Länder in denen Englisch gesprochen wird
\item Finde die Länder mit der höchsten Bevölkerungszahl
\item Gib die Länder aus welche eine Bevölkerungszahl von über 100 Millionen haben
\item Finde die Regionen mit mehr als 12 Ländern
\item Selektiere Namen und die Fläche der Länder und sortiere die Ausgabe bei Namen
\item Finde alle Regionen mit mehr als 13 Ländern und deren totale Fläche größer
ist als 1.000.000 km²
\item Berechne Gesamtfläche der Länder pro Region. Verwende \texttt{sum()} und \texttt{group by}.
\item Selektiere die Länder ID und den Ländernamen von der countries Tabelle.
Limitiere die Ausgabe auf 50 Einträge und sortiere sie absteigend.
\item Selektiere die Population vom Land Portugal.
\item Definiere einen Inner Join mit Ländern und Regionen.
Verwende die \texttt{using} Klausel.
\item Wie viele Länder sind zwischen 1980 und 1996 unabhängig geworden?
\item Welche offizielle Sprache wird in Kuba gesprochen? Die ID ist ausreichend.
\item Selektiere alles von den Vips und sortiere die Ausgabe nach Namen aufsteigend.
\item Selektiere alles von den Vips und sortiere die Ausgabe nach Namen absteigend.
\item Auf welchem Kontinent liegt Mexico?
\item Welchen Namen hat der Staat mit der ID 18?
\item Füge eine Abfrage in unser Dokument ein. Sie darf nicht von dieser Aufgabe stammen.
\end{enumerate}
\end{document}